Ameba-AIoT/ameba-camera-sensor-driver/rtl8735_driver_code_sensor/source/lib_isp/rtstream/hardware/isp/hardware/include/regs/rts3915/isp_reg_uvtune.h
#ifndef _ISP_REG_UVTUNE_H_INC_
#define _ISP_REG_UVTUNE_H_INC_

#include <isp_reg.h>
#include <isp_reg_base.h>

#define UVTUNE_MAT0 (UVTUNE_REG_BASE + 0x0000)
#define UVTUNE_MAT1 (UVTUNE_REG_BASE + 0x0004)
#define UVTUNE_MAT2 (UVTUNE_REG_BASE + 0x0008)
#define UVTUNE_MAT3 (UVTUNE_REG_BASE + 0x000C)
#define UVTUNE_MAT4 (UVTUNE_REG_BASE + 0x0010)
#define UVTUNE_MAT5 (UVTUNE_REG_BASE + 0x0014)
#define UVTUNE_MAT6 (UVTUNE_REG_BASE + 0x0018)
#define UVTUNE_MAT7 (UVTUNE_REG_BASE + 0x001C)
#define UVTUNE_MAT8 (UVTUNE_REG_BASE + 0x0020)
#define UVTUNE_MAT9 (UVTUNE_REG_BASE + 0x0024)
#define UVTUNE_MAT10 (UVTUNE_REG_BASE + 0x0028)
#define UVTUNE_MAT11 (UVTUNE_REG_BASE + 0x002C)
#define UVTUNE_MAT12 (UVTUNE_REG_BASE + 0x0030)
#define UVTUNE_MAT13 (UVTUNE_REG_BASE + 0x0034)
#define UVTUNE_MAT14 (UVTUNE_REG_BASE + 0x0038)
#define UVTUNE_MAT15 (UVTUNE_REG_BASE + 0x003C)
#define UVTUNE_MAT16 (UVTUNE_REG_BASE + 0x0040)
#define UVTUNE_MAT17 (UVTUNE_REG_BASE + 0x0044)
#define UVTUNE_MAT18 (UVTUNE_REG_BASE + 0x0048)
#define UVTUNE_MAT19 (UVTUNE_REG_BASE + 0x004C)
#define UVTUNE_MAT20 (UVTUNE_REG_BASE + 0x0050)
#define UVTUNE_MAT21 (UVTUNE_REG_BASE + 0x0054)
#define UVTUNE_MAT22 (UVTUNE_REG_BASE + 0x0058)
#define UVTUNE_MAT23 (UVTUNE_REG_BASE + 0x005C)
#define UVTUNE_MAT24 (UVTUNE_REG_BASE + 0x0060)
#define UVTUNE_MAT25 (UVTUNE_REG_BASE + 0x0064)
#define UVTUNE_MAT26 (UVTUNE_REG_BASE + 0x0068)
#define UVTUNE_MAT27 (UVTUNE_REG_BASE + 0x006C)
#define UVTUNE_MAT28 (UVTUNE_REG_BASE + 0x0070)
#define UVTUNE_MAT29 (UVTUNE_REG_BASE + 0x0074)
#define UVTUNE_MAT30 (UVTUNE_REG_BASE + 0x0078)
#define UVTUNE_MAT31 (UVTUNE_REG_BASE + 0x007C)
#define UVS_THD (UVTUNE_REG_BASE + 0x0080)
#define UVS_RATE (UVTUNE_REG_BASE + 0x0084)
#define UV_SLOPE (UVTUNE_REG_BASE + 0x0088)
#define UV_SYNC (UVTUNE_REG_BASE + 0x008C)

/* UVTUNE_MAT0 0x0000 */
#define UN_TUNE_MAT0_OFFSET 0
#define UN_TUNE_MAT0_BITS 11
#define UN_TUNE_MAT0_MASK (((1 << 11) - 1) << 0)
#define UN_TUNE_MAT1_OFFSET 16
#define UN_TUNE_MAT1_BITS 11
#define UN_TUNE_MAT1_MASK (((1 << 11) - 1) << 16)
/* UVTUNE_MAT1 0x0004 */
#define UN_TUNE_MAT2_OFFSET 0
#define UN_TUNE_MAT2_BITS 11
#define UN_TUNE_MAT2_MASK (((1 << 11) - 1) << 0)
#define UN_TUNE_MAT3_OFFSET 16
#define UN_TUNE_MAT3_BITS 11
#define UN_TUNE_MAT3_MASK (((1 << 11) - 1) << 16)
/* UVTUNE_MAT2 0x0008 */
#define UN_TUNE_MAT4_OFFSET 0
#define UN_TUNE_MAT4_BITS 11
#define UN_TUNE_MAT4_MASK (((1 << 11) - 1) << 0)
#define UN_TUNE_MAT5_OFFSET 16
#define UN_TUNE_MAT5_BITS 11
#define UN_TUNE_MAT5_MASK (((1 << 11) - 1) << 16)
/* UVTUNE_MAT3 0x000C */
#define UN_TUNE_MAT6_OFFSET 0
#define UN_TUNE_MAT6_BITS 11
#define UN_TUNE_MAT6_MASK (((1 << 11) - 1) << 0)
#define UN_TUNE_MAT7_OFFSET 16
#define UN_TUNE_MAT7_BITS 11
#define UN_TUNE_MAT7_MASK (((1 << 11) - 1) << 16)
/* UVTUNE_MAT4 0x0010 */
#define UN_TUNE_MAT8_OFFSET 0
#define UN_TUNE_MAT8_BITS 11
#define UN_TUNE_MAT8_MASK (((1 << 11) - 1) << 0)
#define UN_TUNE_MAT9_OFFSET 16
#define UN_TUNE_MAT9_BITS 11
#define UN_TUNE_MAT9_MASK (((1 << 11) - 1) << 16)
/* UVTUNE_MAT5 0x0014 */
#define UN_TUNE_MAT10_OFFSET 0
#define UN_TUNE_MAT10_BITS 11
#define UN_TUNE_MAT10_MASK (((1 << 11) - 1) << 0)
#define UN_TUNE_MAT11_OFFSET 16
#define UN_TUNE_MAT11_BITS 11
#define UN_TUNE_MAT11_MASK (((1 << 11) - 1) << 16)
/* UVTUNE_MAT6 0x0018 */
#define UN_TUNE_MAT12_OFFSET 0
#define UN_TUNE_MAT12_BITS 11
#define UN_TUNE_MAT12_MASK (((1 << 11) - 1) << 0)
#define UN_TUNE_MAT13_OFFSET 16
#define UN_TUNE_MAT13_BITS 11
#define UN_TUNE_MAT13_MASK (((1 << 11) - 1) << 16)
/* UVTUNE_MAT7 0x001C */
#define UN_TUNE_MAT14_OFFSET 0
#define UN_TUNE_MAT14_BITS 11
#define UN_TUNE_MAT14_MASK (((1 << 11) - 1) << 0)
#define UN_TUNE_MAT15_OFFSET 16
#define UN_TUNE_MAT15_BITS 11
#define UN_TUNE_MAT15_MASK (((1 << 11) - 1) << 16)
/* UVTUNE_MAT8 0x0020 */
#define UN_TUNE_MAT16_OFFSET 0
#define UN_TUNE_MAT16_BITS 11
#define UN_TUNE_MAT16_MASK (((1 << 11) - 1) << 0)
#define UN_TUNE_MAT17_OFFSET 16
#define UN_TUNE_MAT17_BITS 11
#define UN_TUNE_MAT17_MASK (((1 << 11) - 1) << 16)
/* UVTUNE_MAT9 0x0024 */
#define UN_TUNE_MAT18_OFFSET 0
#define UN_TUNE_MAT18_BITS 11
#define UN_TUNE_MAT18_MASK (((1 << 11) - 1) << 0)
#define UN_TUNE_MAT19_OFFSET 16
#define UN_TUNE_MAT19_BITS 11
#define UN_TUNE_MAT19_MASK (((1 << 11) - 1) << 16)
/* UVTUNE_MAT10 0x0028 */
#define UN_TUNE_MAT20_OFFSET 0
#define UN_TUNE_MAT20_BITS 11
#define UN_TUNE_MAT20_MASK (((1 << 11) - 1) << 0)
#define UN_TUNE_MAT21_OFFSET 16
#define UN_TUNE_MAT21_BITS 11
#define UN_TUNE_MAT21_MASK (((1 << 11) - 1) << 16)
/* UVTUNE_MAT11 0x002C */
#define UN_TUNE_MAT22_OFFSET 0
#define UN_TUNE_MAT22_BITS 11
#define UN_TUNE_MAT22_MASK (((1 << 11) - 1) << 0)
#define UN_TUNE_MAT23_OFFSET 16
#define UN_TUNE_MAT23_BITS 11
#define UN_TUNE_MAT23_MASK (((1 << 11) - 1) << 16)
/* UVTUNE_MAT12 0x0030 */
#define UN_TUNE_MAT24_OFFSET 0
#define UN_TUNE_MAT24_BITS 11
#define UN_TUNE_MAT24_MASK (((1 << 11) - 1) << 0)
#define UN_TUNE_MAT25_OFFSET 16
#define UN_TUNE_MAT25_BITS 11
#define UN_TUNE_MAT25_MASK (((1 << 11) - 1) << 16)
/* UVTUNE_MAT13 0x0034 */
#define UN_TUNE_MAT26_OFFSET 0
#define UN_TUNE_MAT26_BITS 11
#define UN_TUNE_MAT26_MASK (((1 << 11) - 1) << 0)
#define UN_TUNE_MAT27_OFFSET 16
#define UN_TUNE_MAT27_BITS 11
#define UN_TUNE_MAT27_MASK (((1 << 11) - 1) << 16)
/* UVTUNE_MAT14 0x0038 */
#define UN_TUNE_MAT28_OFFSET 0
#define UN_TUNE_MAT28_BITS 11
#define UN_TUNE_MAT28_MASK (((1 << 11) - 1) << 0)
#define UN_TUNE_MAT29_OFFSET 16
#define UN_TUNE_MAT29_BITS 11
#define UN_TUNE_MAT29_MASK (((1 << 11) - 1) << 16)
/* UVTUNE_MAT15 0x003C */
#define UN_TUNE_MAT30_OFFSET 0
#define UN_TUNE_MAT30_BITS 11
#define UN_TUNE_MAT30_MASK (((1 << 11) - 1) << 0)
#define UN_TUNE_MAT31_OFFSET 16
#define UN_TUNE_MAT31_BITS 11
#define UN_TUNE_MAT31_MASK (((1 << 11) - 1) << 16)
/* UVTUNE_MAT16 0x0040 */
#define UN_TUNE_MAT32_OFFSET 0
#define UN_TUNE_MAT32_BITS 11
#define UN_TUNE_MAT32_MASK (((1 << 11) - 1) << 0)
#define UN_TUNE_MAT33_OFFSET 16
#define UN_TUNE_MAT33_BITS 11
#define UN_TUNE_MAT33_MASK (((1 << 11) - 1) << 16)
/* UVTUNE_MAT17 0x0044 */
#define UN_TUNE_MAT34_OFFSET 0
#define UN_TUNE_MAT34_BITS 11
#define UN_TUNE_MAT34_MASK (((1 << 11) - 1) << 0)
#define UN_TUNE_MAT35_OFFSET 16
#define UN_TUNE_MAT35_BITS 11
#define UN_TUNE_MAT35_MASK (((1 << 11) - 1) << 16)
/* UVTUNE_MAT18 0x0048 */
#define UN_TUNE_MAT36_OFFSET 0
#define UN_TUNE_MAT36_BITS 11
#define UN_TUNE_MAT36_MASK (((1 << 11) - 1) << 0)
#define UN_TUNE_MAT37_OFFSET 16
#define UN_TUNE_MAT37_BITS 11
#define UN_TUNE_MAT37_MASK (((1 << 11) - 1) << 16)
/* UVTUNE_MAT19 0x004C */
#define UN_TUNE_MAT38_OFFSET 0
#define UN_TUNE_MAT38_BITS 11
#define UN_TUNE_MAT38_MASK (((1 << 11) - 1) << 0)
#define UN_TUNE_MAT39_OFFSET 16
#define UN_TUNE_MAT39_BITS 11
#define UN_TUNE_MAT39_MASK (((1 << 11) - 1) << 16)
/* UVTUNE_MAT20 0x0050 */
#define UN_TUNE_MAT40_OFFSET 0
#define UN_TUNE_MAT40_BITS 11
#define UN_TUNE_MAT40_MASK (((1 << 11) - 1) << 0)
#define UN_TUNE_MAT41_OFFSET 16
#define UN_TUNE_MAT41_BITS 11
#define UN_TUNE_MAT41_MASK (((1 << 11) - 1) << 16)
/* UVTUNE_MAT21 0x0054 */
#define UN_TUNE_MAT42_OFFSET 0
#define UN_TUNE_MAT42_BITS 11
#define UN_TUNE_MAT42_MASK (((1 << 11) - 1) << 0)
#define UN_TUNE_MAT43_OFFSET 16
#define UN_TUNE_MAT43_BITS 11
#define UN_TUNE_MAT43_MASK (((1 << 11) - 1) << 16)
/* UVTUNE_MAT22 0x0058 */
#define UN_TUNE_MAT44_OFFSET 0
#define UN_TUNE_MAT44_BITS 11
#define UN_TUNE_MAT44_MASK (((1 << 11) - 1) << 0)
#define UN_TUNE_MAT45_OFFSET 16
#define UN_TUNE_MAT45_BITS 11
#define UN_TUNE_MAT45_MASK (((1 << 11) - 1) << 16)
/* UVTUNE_MAT23 0x005C */
#define UN_TUNE_MAT46_OFFSET 0
#define UN_TUNE_MAT46_BITS 11
#define UN_TUNE_MAT46_MASK (((1 << 11) - 1) << 0)
#define UN_TUNE_MAT47_OFFSET 16
#define UN_TUNE_MAT47_BITS 11
#define UN_TUNE_MAT47_MASK (((1 << 11) - 1) << 16)
/* UVTUNE_MAT24 0x0060 */
#define UN_TUNE_MAT48_OFFSET 0
#define UN_TUNE_MAT48_BITS 11
#define UN_TUNE_MAT48_MASK (((1 << 11) - 1) << 0)
#define UN_TUNE_MAT49_OFFSET 16
#define UN_TUNE_MAT49_BITS 11
#define UN_TUNE_MAT49_MASK (((1 << 11) - 1) << 16)
/* UVTUNE_MAT25 0x0064 */
#define UN_TUNE_MAT50_OFFSET 0
#define UN_TUNE_MAT50_BITS 11
#define UN_TUNE_MAT50_MASK (((1 << 11) - 1) << 0)
#define UN_TUNE_MAT51_OFFSET 16
#define UN_TUNE_MAT51_BITS 11
#define UN_TUNE_MAT51_MASK (((1 << 11) - 1) << 16)
/* UVTUNE_MAT26 0x0068 */
#define UN_TUNE_MAT52_OFFSET 0
#define UN_TUNE_MAT52_BITS 11
#define UN_TUNE_MAT52_MASK (((1 << 11) - 1) << 0)
#define UN_TUNE_MAT53_OFFSET 16
#define UN_TUNE_MAT53_BITS 11
#define UN_TUNE_MAT53_MASK (((1 << 11) - 1) << 16)
/* UVTUNE_MAT27 0x006C */
#define UN_TUNE_MAT54_OFFSET 0
#define UN_TUNE_MAT54_BITS 11
#define UN_TUNE_MAT54_MASK (((1 << 11) - 1) << 0)
#define UN_TUNE_MAT55_OFFSET 16
#define UN_TUNE_MAT55_BITS 11
#define UN_TUNE_MAT55_MASK (((1 << 11) - 1) << 16)
/* UVTUNE_MAT28 0x0070 */
#define UN_TUNE_MAT56_OFFSET 0
#define UN_TUNE_MAT56_BITS 11
#define UN_TUNE_MAT56_MASK (((1 << 11) - 1) << 0)
#define UN_TUNE_MAT57_OFFSET 16
#define UN_TUNE_MAT57_BITS 11
#define UN_TUNE_MAT57_MASK (((1 << 11) - 1) << 16)
/* UVTUNE_MAT29 0x0074 */
#define UN_TUNE_MAT58_OFFSET 0
#define UN_TUNE_MAT58_BITS 11
#define UN_TUNE_MAT58_MASK (((1 << 11) - 1) << 0)
#define UN_TUNE_MAT59_OFFSET 16
#define UN_TUNE_MAT59_BITS 11
#define UN_TUNE_MAT59_MASK (((1 << 11) - 1) << 16)
/* UVTUNE_MAT30 0x0078 */
#define UN_TUNE_MAT60_OFFSET 0
#define UN_TUNE_MAT60_BITS 11
#define UN_TUNE_MAT60_MASK (((1 << 11) - 1) << 0)
#define UN_TUNE_MAT61_OFFSET 16
#define UN_TUNE_MAT61_BITS 11
#define UN_TUNE_MAT61_MASK (((1 << 11) - 1) << 16)
/* UVTUNE_MAT31 0x007C */
#define UN_TUNE_MAT62_OFFSET 0
#define UN_TUNE_MAT62_BITS 11
#define UN_TUNE_MAT62_MASK (((1 << 11) - 1) << 0)
#define UN_TUNE_MAT63_OFFSET 16
#define UN_TUNE_MAT63_BITS 11
#define UN_TUNE_MAT63_MASK (((1 << 11) - 1) << 16)
/* UVS_THD 0x0080 */
#define UVS_THD0_OFFSET 0
#define UVS_THD0_BITS 12
#define UVS_THD0_MASK (((1 << 12) - 1) << 0)
#define UVS_THD1_OFFSET 16
#define UVS_THD1_BITS 12
#define UVS_THD1_MASK (((1 << 12) - 1) << 16)
/* UVS_RATE 0x0084 */
#define UVS_RATE_OFFSET 0
#define UVS_RATE_BITS 5
#define UVS_RATE_MASK (((1 << 5) - 1) << 0)
/* UV_SLOPE 0x0088 */
#define UV_SLOPE_OFFSET 0
#define UV_SLOPE_BITS 14
#define UV_SLOPE_MASK (((1 << 14) - 1) << 0)
/* UV_SYNC 0x008C */
#define UV_SYNC_OFFSET 0
#define UV_SYNC_BITS 1
#define UV_SYNC_MASK (((1 << 1) - 1) << 0)

#endif /* _ISP_REG_UVTUNE_H_INC_ */

